Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 5, 1)]            0         
_________________________________________________________________
lstm (LSTM)                  (None, 448)               806400    
_________________________________________________________________
dense (Dense)                (None, 448)               201152    
_________________________________________________________________
dense_1 (Dense)              (None, 448)               201152    
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 449       
=================================================================
Total params: 1,209,153
Trainable params: 1,209,153
Non-trainable params: 0
_________________________________________________________________
