Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 5, 1)]            0         
_________________________________________________________________
bidirectional (Bidirectional (None, 704)               996864    
_________________________________________________________________
dense (Dense)                (None, 352)               248160    
_________________________________________________________________
dense_1 (Dense)              (None, 352)               124256    
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 353       
=================================================================
Total params: 1,369,633
Trainable params: 1,369,633
Non-trainable params: 0
_________________________________________________________________
