Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 11, 1)]           0         
_________________________________________________________________
bidirectional (Bidirectional (None, 768)               1185792   
_________________________________________________________________
dense (Dense)                (None, 384)               295296    
_________________________________________________________________
dense_1 (Dense)              (None, 384)               147840    
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 385       
=================================================================
Total params: 1,629,313
Trainable params: 1,629,313
Non-trainable params: 0
_________________________________________________________________
